//Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
//•	На всеки четен етаж има само офиси
//•	На всеки нечетен етаж има само апартаменти
//•	Всеки апартамент се означава по следния начин : А
//{ номер на етажа}
//{ номер на апартамента}, номерата на апартаментите започват от 0.
//•	Всеки офис се означава по следния начин : О
//{ номер на етажа}
//{ номер на офиса}, номерата на офисите също започват от 0.
//•	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
//От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.


using System;


internal class Program
{
    static void Main()
    {
        // User input:
        int floors = int.Parse(Console.ReadLine());
        int rooms = int.Parse(Console.ReadLine());
        // Top floor:
        if (floors > 0)
        {
            for (int i = 0; i < rooms; i++)
            {
                Console.Write($"L{floors}{i} ");
            }
        }
        Console.WriteLine();
        floors--;
        // Other floors:
        for (int i = floors; i > 0; i--)
        {
            for (int j = 0; j < rooms; j++)
            {
                if (i % 2 == 0) Console.Write($"O{i}{j} ");
                else Console.Write($"A{i}{j} ");
            }
            Console.WriteLine();
        }


    }
}