//Да се напише програма, която чете две цели числа n и l, въведени от потребителя,
//и генерира по азбучен ред всички възможни  пароли, които се състоят от следните 5 символа:
//•	Символ 1: цифра от 1 до n.
//•	Символ 2: цифра от 1 до n.
//•	Символ 3: малка буква измежду първите l букви на латинската азбука.
//•	Символ 4: малка буква измежду първите l букви на латинската азбука.
//•	Символ 5: цифра от 1 до n, по-голяма от първите 2 цифри.
//Вход
//Входът се чете от конзолата и се състои от две цели числа n и l в интервала [1…9], по едно на ред.
//Изход
//На конзолата трябва да се отпечатат всички пароли по азбучен ред, разделени с интервал.

using System;

public class Program
{
	public static void Main()
	{
		int n = int.Parse(Console.ReadLine());
		int l = int.Parse(Console.ReadLine());
		for (int one = 1; one < n; one++)
			for (int two = 1; two < n; two++)
				for (char three = 'a'; three < 'a' + l; three++)
					for (char four = 'a'; four < 'a' + l; four++)
						for (int five = one + 1; five <= n; five++)
							if (five > two) Console.Write("{0}{1}{2}{3}{4} ", one, two, three, four, five);
	}
}