//Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си,
//а именно вечеря за запознанства - "Предизвикай Сватбата".
//Напишете програма, която отпечатва всички възможни срещи на клиентите на ресторанта.
//При настаняване всеки мъж и всяка жена получават талончета с поредни номера стартирайки от 1.
//Ако бъдат заети всички маси, програмата трябва да приключи. Всяка маса има две места.
//Вход
//От конзолата се четат точно 3 числа, всяко на отделен ред:
//•	Броя клиенти мъже - цяло число в интервала [1...100]
//•	Броя клиенти жени - цяло число в интервала [1...100]
//•	Максималният брой маси - цяло число в интервала [1...100]
//Изход
//На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
//•	({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...

using System;

class Program
{
    static void Main(string[] args)
    {
        int men = int.Parse(Console.ReadLine());
        int women = int.Parse(Console.ReadLine());
        int tables = int.Parse(Console.ReadLine());

        for (int m = 1; m <= men; m++)
        {
            for (int w = 1; w <= women; w++)
            {
                Console.Write($"({m} <-> {w}) ");
                tables--;
                if (tables == 0) return;
            }
        }
    }
}