//Да се напише програма, която чете едно цяло число N, въведено от потребителя, и генерира всички възможни "специални" числа от 1111 до 9999.
//За да бъде "специалнo" едно число, то трябва да отговаря на следното условие: 
//•	N да се дели на всяка една от неговите цифри без остатък.
//Пример: при N = 16, 2418 е специално число:
//•	16 / 2 = 8 без остатък
//•	16 / 4 = 4 без остатък
//•	16 / 1 = 16 без остатък
//•	16 / 8 = 2 без остатък
//Вход
//Входът се чете от конзолата и се състои от едно цяло число в интервала [1…600000]
//Изход
//На конзолата трябва да се отпечатат всички "специални" числа, разделени с интервал

using System;

internal class Program
{
    static void Main()
    {
        int n = int.Parse(Console.ReadLine());

        for (int i = 1111; i <= 9999; i++)
        {
            bool special = true;
            string str = i.ToString();
            for (int j = 0; j <= 3; j++)
            {
                string digit = str[j].ToString(); ;
                int num = int.Parse(digit);
                if (num == 0)
                {
                    special = false;
                }
                else if (n % num != 0) special = false;
            }
            if (special) Console.Write($"{i} ");
        }
    }
}