//Задачата ви е да напишете програма, която приема името на отбор и прави статистика за него.
//През един сезон всеки отбор изиграва определен брой футболни срещи,
//като за всяка среща на отбора се дават точки в зависимост от изхода от срещата.
//Има три възможни изхода от една среща:
//	W - Отборът е победител и получава 3 точки
//	D - Срещата е завършила без победител и отборът получава 1 точка
//	L - Отборът е загубил срещата и не получава точки
//Напишете програма, която приема името на футболен отбор и извежда неговата статистика,
//на база на изиграните срещи през този сезон.
//Неговата статистика трябва да включва общия брой спечелени точки през настоящия сезон,
//подробна статистика за изхода на изиграните игри и процент победи през сезона.
//Ако отборът по някаква причина не е играл мачове през настоящия сезон се извежда специално съобщение.
//Вход
//От конзолата се четат два реда:
//•	Името на футболния отбор, за който водим статистика - текст
//•	Броя изиграни срещи през настоящия сезон - цяло число в интервала [0… 100]
//За всяка изиграна среща се прочита отделен ред:
//o Резултатът от изиграната среща в един от горепосочените формати – символ с възможности 'W', 'D' и 'L'
//Изход
//В зависимост от това дали отборът е играл мачове през настоящия сезон се извеждат два вида изход.
//•	Ако отборът не е изиграл нито един мач през настоящия сезон се извежда точно един ред в следния формат:
//o "{името на отбора} hasn't played any games during this season."
//•	Ако отборът е изиграл един мач или повече се извеждат шест реда в следния формат:
//o "{името на отбора} has won {брой спечелени точки} points during this season"
//o "Total stats:"
//o "## W: {брой спечелени игри}"
//o "## D: {брой игри, завършили наравно}"
//o "## L: {брой загубени игри}"
//o "Win rate: {процент спечелени игри}%"
//Процентът спечелени игри трябва да бъде форматиран до втората цифра след десетичния знак.

using System;

public class Program
{
	public static void Main()
	{
		string name = Console.ReadLine();
		int n = int.Parse(Console.ReadLine());
		int wins = 0;
		int draws = 0;
		int losses = 0;

		for (int i = 1; i <= n; i++)
		{
			string outcome = Console.ReadLine();
			if (outcome == "W") wins++;
			else if (outcome == "L") losses++;
			else draws++;
		}
		int result = wins * 3 + draws;

		if (n < 1) Console.WriteLine("{0} hasn't played any games during this season.", name);
		else
		{
			Console.WriteLine("{0} has won {1} points during this season.", name, result);
			Console.WriteLine("Total stats:");
			Console.WriteLine("## W: {0}", wins);
			Console.WriteLine("## D: {0}", draws);
			Console.WriteLine("## L: {0}", losses);
			Console.WriteLine("Win rate: {0:f2}%", wins * 100.0 / n);
		}
	}
}