//Напишете програма, която да пресмята резултата от игра.
//Първо получавате число, което показва колко хода ще продължи играта.
//После за всеки ход на играта ще получавате по едно ново число.
//Според интервала в който попада числото се прибавят точки. Ако числото е отрицателно или по-голямо 50, тогава то е невалидно.
//В началото на играта резултата е 0 и на всеки ход се прибавят точки по следният начин:

//•	От 0 до 9  20 % от числото
//•	От 10 до 19  30 % от числото
//•	От 20 до 29  40 % от числото
//•	От 30 до 39  50 точки
//•	От 40 до 50  100 точки
//•	Невалидно число  резултата се дели на 2

//Освен резултата програмата трябва да изкарва статистика за проценти числа в дадените интервали.
//Вход
//Входът се чете от конзолата:
//•	Първи ред - колко хода ще има по време на играта – цяло число в интервала [1...100]
//•	За всеки ход – числата, които се проверяват в кой интервал са – цели числа в интервала [-100...100]
//Изход
//Да се отпечата на конзолата 7 реда:
//•	1ви ред: "{Краен резултат}"
//•	2ри ред: "From 0 to 9: {процент в интервала}%"
//•	3ти ред: "From 10 to 19: {процент в интервала}%"
//•	4ти ред: "From 20 to 29: {процент в интервала}%"
//•	5ти ред: "From 30 to 39: {процент в интервала}%"
//•	6ти ред: "From 40 to 50: {процент в интервала}%"
//•	7ми ред: "Invalid numbers: {процент в интервала}%"
//Всички числа трябва да са форматирана до вторият знак след запетаята.

using System;


class Program
{
    static void Main()
    {
        int turns = int.Parse(Console.ReadLine());
        int zero = 0;
        int one = 0;
        int two = 0;
        int three = 0;
        int four = 0;
        int invalid = 0;
        double result = 0;

        for (int i = 0; i < turns; i++)
        {
            int num = int.Parse(Console.ReadLine());
            if (num >= 0 && num <= 9) { zero++; result += 0.2 * num; }
            else if (num >= 10 && num <= 19) { one++; result += 0.3 * num; }
            else if (num >= 20 && num <= 29) { two++; result += 0.4 * num; }
            else if (num >= 30 && num <= 39) { three++; result += 50; }
            else if (num >= 40 && num <= 50) { four++; result += 100; }
            else { result /= 2; invalid++; }
        }

        Console.WriteLine($"{result:f2}");
        Console.WriteLine($"From 0 to 9: {zero * 100.0 / turns:f2}%");
        Console.WriteLine($"From 10 to 19: {one * 100.0 / turns:f2}%");
        Console.WriteLine($"From 20 to 29: {two * 100.0 / turns:f2}%");
        Console.WriteLine($"From 30 to 39: {three * 100.0 / turns:f2}%");
        Console.WriteLine($"From 40 to 50: {four * 100.0 / turns:f2}%");
        Console.WriteLine($"Invalid numbers: {invalid * 100.0 / turns:f2}%");
    }
}