//Басейн с обем V има две тръби от които се пълни. Всяка тръба има определен дебит (литрите вода минаващи през една тръба за един час).
//Работникът пуска тръбите едновременно и излиза за N часа. Напишете програма, която изкарва състоянието на басейна, в момента, когато работникът се върне. 
//Вход
//От конзолата се четат четири реда:
//•	Първият ред съдържа числото V – Обем на басейна в литри – цяло число в интервала [1…10000].
//•	Вторият ред съдържа числото P1 – дебит на първата тръба за час – цяло число в интервала [1…5000].
//•	Третият ред съдържа числото P2 – дебит на втората тръба за час– цяло число в интервала [1…5000].
//•	Четвъртият ред съдържа числото H – часовете които работникът отсъства – реално число в интервала [1.0…24.00]
//Изход
//Да се отпечата на конзолата едно от двете възможни състояния:
//•	До колко се е запълнил басейна и коя тръба с колко процента е допринесла.
//o	"The pool is {запълненост на басейна в проценти}% full. Pipe 1: {процент вода от първата тръба}%. Pipe 2: {процент вода от втората тръба}%."
//Aко басейнът се е препълнил – с колко литра е прелял за даденото време.
//o	"For {часовете, които тръбите са пълнили вода} hours the pool overflows with {литрите вода в повече} liters."

using System;


class Program
{
    static void Main(string[] args)
    {
        int v = int.Parse(Console.ReadLine());
        int p1 = int.Parse(Console.ReadLine());
        int p2 = int.Parse(Console.ReadLine());
        double h = double.Parse(Console.ReadLine());

        double pipe1 = p1 * h;
        double pipe2 = p2 * h;
        double allWater = pipe1 + pipe2;
        if (allWater <= v) Console.WriteLine($"The pool is {allWater * 100 / v:f2}% full. Pipe 1: {pipe1 * 100 / allWater:f2}%. Pipe 2: {pipe2 * 100 / allWater:f2}%.");
        else Console.WriteLine($"For {h} hours the pool overflows with {allWater - v:f2} liters.");
    }
}