//Отговаряте за логистиката на различни товари. В зависимост от теглото на товара е нужно различно превозно средство.
//Цената на тон, за която се превозва товара е различна за всяко превозно средство:
//•	До 3 тона – микробус(200 лева на тон)
//•	От 4 до 11 тона – камион(175 лева на тон)
//•	12 и повече тона – влак (120 лева на тон)
//Вашата задача е да изчислите средната цена на тон превозен товар,
//както и процента на тоновете  превозвани с всяко превозно средство, спрямо общото тегло(в тонове) на всички товари.
//Вход
//От конзолата се четат поредица от числа, всяко на отделен ред:
//•	На първия ред – броя на товарите за превоз – цяло число в интервала [1...1000]
//•	За всеки един товар на отделен ред – тонажа на товара – цяло число в интервала [1...1000]
//Изход
//Да се отпечатат на конзолата 4 реда, както следва:
//•	Първи ред – средната цена на тон превозен товар (закръглена до втория знак след дес. запетая);
//•	Втори ред – процентът тона превозвани с микробус (процент между 0.00% и 100.00%);
//•	Трети ред – процентът  тона превозвани с камион (процент между 0.00% и 100.00%);
//•	Четвърти ред – процентът тона превозвани с влак (процент между 0.00% и 100.00%).

using System;

class Program
{
    static void Main(string[] args)
    {
        int n = int.Parse(Console.ReadLine());
        int van = 0;
        int truck = 0;
        int train = 0;
        double price = 0;

        for (int i = 0; i < n; i++)
        {
            int cargo = int.Parse(Console.ReadLine());
            if (cargo <= 3) { van += cargo; price += cargo * 200; }
            else if (cargo <= 11) { truck += cargo; price += cargo * 175; }
            else { train += cargo; price += cargo * 120; }
        }
        int totalCargo = van + truck + train;
        Console.WriteLine($"{price / (double)totalCargo:f2}");
        Console.WriteLine($"{van * 100.0 / totalCargo:f2}%");
        Console.WriteLine($"{truck * 100.0 / totalCargo:f2}%");
        Console.WriteLine($"{train * 100.0 / totalCargo:f2}%");
    }
}