//Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме точно вас за създаването
//на новата им система за генериране на специални автомобилни номера.
//Всеки един специален автомобилен номер се състой от четири числа.
//Условията, които разграничават специалните от обикновените номера са следните: 
//•	Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна, завършва на четна
//•	Първата цифра от номера е по-голяма от последната
//•	Сумата от втората и третата цифра трябва да е четно число
//Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
//Вход
//1.	Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
//2.Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
//Изход
//На конзолата трябва да се отпечатат всички специални номера, разделени с интервал.

using System;

class Program
{
    static void Main(string[] args)
    {
        int lower = int.Parse(Console.ReadLine());
        int higher = int.Parse(Console.ReadLine());

        for (int n1 = lower; n1 <= higher; n1++)
        {
            for (int n2 = lower; n2 <= higher; n2++)
            {
                for (int n3 = lower; n3 <= higher; n3++)
                {
                    for (int n4 = lower; n4 <= higher; n4++)
                    {
                        bool condition1 = (n1 % 2 == 0 && n4 % 2 != 0) || (n1 % 2 != 0 && n4 % 2 == 0);
                        bool condition2 = n1 > n4;
                        bool condition3 = (n2 + n3) % 2 == 0;
                        if (condition1 && condition2 && condition3) Console.Write($"{n1}{n2}{n3}{n4} ");
                    }
                }
            }
        }
    }
}