//Сезона за изкачване на алпийски върхове започва и всички алпинисти, се запасяват с енергийни гелове за изкачването.
//Фирма предлага малки и големи разфасовки с по 2 бр. и 5 бр. енергийни гела,
//като цената на един гел зависи от плодовете, от които е направен.
//В зависимост от размера на разфасовката, цената за брой енергиен гел е различна.
//От конзолата се четат плодовете, размерът на опаковката ((малка) 2 бр.или(голяма) 5 бр.),
//както и колко разфасовки са поръчани. Да се напише програма, която изчислява сумата, която трябва да се плати за поръчката. 
//	Диня 	Манго	Ананас	Малина
//2 броя (small)	56 лв./ бр.  36.66 лв./ бр.   42.10 лв./ бр.   20 лв./ бр.
//5 броя(big)    28.70 лв./ бр.   19.60 лв./ бр.   24.80 лв./ бр.   15.20 лв./ бр.
//При поръчки:
//•	от 400 лв.до 1000 лв.включително има 15% отстъпка
//•	над 1000 лв. има 50% отстъпка
//Вход
//От конзолата се четат 3 реда:
//1.Плод - текст с възможности: "Watermelon", "Mango", "Pineapple" или "Raspberry"
//2.Размерът на сета - текст с възможности: "small" или "big"
//3.Брой на поръчаните сетове - цяло число в интервала [1 … 10000]
//Изход
//На конзолата се отпечатва 1 ред:
//•	Цената, която трябва да се заплати, форматирана до втория знак след десетичната запетая,
//в следния формат:
//"{цената} lv."

using System;


namespace SU_Resource
{
    public class Program
    {
        static void Main()
        {
            string fruit = Console.ReadLine();
            string set = Console.ReadLine();
            int quantity = int.Parse(Console.ReadLine());
            double price = 0;

            switch (fruit)
            {
                case "Watermelon":
                    if (set == "small") price = 56.00;
                    else price = 28.70;
                    break;
                case "Mango":
                    if (set == "small") price = 36.66;
                    else price = 19.60;
                    break;
                case "Pineapple":
                    if (set == "small") price = 42.10;
                    else price = 24.80;
                    break;
                case "Raspberry":
                    if (set == "small") price = 20.00;
                    else price = 15.20;
                    break;
            }
            if (set == "small") price *= 2;
            else price *= 5;

            double total = price * quantity;

            if (total > 1000) total -= 0.5 * total;
            else if (total >= 400) total -= 0.15 * total;

            Console.WriteLine($"{total:f2} lv.");
        }
    }
}