//Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка.
//Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира,
//като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка: 
//•	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
//•	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
//•	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
//•	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка


using System;

namespace SU_Resource
{
    internal class Program
    {
        static void Main()
        {
            int fee = int.Parse(Console.ReadLine());
            double shoes = fee * 0.6;
            double outfit = shoes * 0.8;
            double ball = outfit / 4;
            double accessories = ball / 5;
            double total = fee + shoes + outfit + ball + accessories;

            Console.WriteLine(total);

        }
    }
}